src/cf/DataProcessors/ЗагрузитьДанныеСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьДанныеСайта</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеКатегорий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемныйИд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассификаторИд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемныйИд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассификаторИд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеСвойств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемныйИд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассификаторИд</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Общее</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузитьДанныеСайта/Forms/ФормаСопоставления/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеРезультат = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилища);
	
	Объект.СопоставлениеКатегорий.Очистить();
	Для Каждого Строка Из ДанныеРезультат.СопоставлениеКатегорий Цикл
		ЗаполнитьЗначенияСвойств(Объект.СопоставлениеКатегорий.Добавить(), Строка);
	КонецЦикла;
	
	Объект.СопоставлениеТоваров.Очистить();
	Для Каждого Строка Из ДанныеРезультат.СопоставлениеТоваров Цикл
		ЗаполнитьЗначенияСвойств(Объект.СопоставлениеТоваров.Добавить(), Строка);
	КонецЦикла;
	
	Объект.СопоставлениеСвойств.Очистить();
	Для Каждого Строка Из ДанныеРезультат.СопоставлениеСвойств Цикл
		ЗаполнитьЗначенияСвойств(Объект.СопоставлениеСвойств.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображатьТехнчиескуюИнформациюПриИзменении(Элемент)
	
	Элементы.СопоставлениеКатегорийТехническаяИнформация.Видимость = ОтображатьТехническуюИнформацию;
	Элементы.СопоставлениеТоваровТехническаяИнформация.Видимость = ОтображатьТехническуюИнформацию;
	Элементы.СопоставлениеСвойствТехническаяИнформация.Видимость = ОтображатьТехническуюИнформацию;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставлениеТоваров

&НаКлиенте
Процедура СопоставлениеТаблицаПередУдалением2(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеТаблицаПередНачаломДобавления2(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставлениеКатегорий

&НаКлиенте
Процедура СопоставлениеТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеКатегорийПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ТипТовара" , Элементы.СопоставлениеКатегорий.ТекущиеДанные.Ид);
	
	Элементы.СопоставлениеТоваров.ОтборСтрок = ОтборСтрок;
	Элементы.СопоставлениеСвойств.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеТаблицаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставлениеСвойств

&НаКлиенте
Процедура СопоставлениеТаблицаПередУдалением3(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеТаблицаПередНачаломДобавления3(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти
	
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьСопоставление(Команда)
	
	СохранитьСопоставлениеНаСервере();
	
	Закрыть(АдресВременногоХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьСопоставлениеНаСервере()
	
	СтруктураСопоставления = Новый Структура;
	СтруктураСопоставления.Вставить("СопоставлениеКатегорий" , ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.СопоставлениеКатегорий.Выгрузить()));
	СтруктураСопоставления.Вставить("СопоставлениеТоваров" , ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.СопоставлениеТоваров.Выгрузить()));
	СтруктураСопоставления.Вставить("СопоставлениеСвойств" , ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.СопоставлениеСвойств.Выгрузить()));
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураСопоставления,УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
